Clash Bot Webapp Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot-Webapp/runs/run-UqRVmNGUiwgxZpsv

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
data.tfe_outputs.clash-bot-discord-bot: Reading...
data.tfe_outputs.clash-bot-discord-bot: Read complete after 0s [id=ClashBot-ClashBot]
aws_dynamodb_table.clash-bot-teams-table: Refreshing state... [id=server-clash-teams]
aws_iam_role.clash-bot-webapp-task-role: Refreshing state... [id=clash-bot-webapp-webapp-task-role]
aws_iam_policy.webapp_ecr_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-webapp-ecr-ecs-policy]
aws_iam_role.clash-bot-webapp-exec-role: Refreshing state... [id=clash-bot-webapp-webapp-exec-role]
aws_security_group.clash-bot-webapp-sg: Refreshing state... [id=sg-0a806c6bf3b23a5b2]
aws_lb_target_group.clash-bot-ws-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:targetgroup/clash-bot-webapp-ws-tg/ca204c020ff70c8b]
aws_lb_target_group.clash-bot-webapp-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:targetgroup/clash-bot-webapp-webapp-tg/c7c05d33183240aa]
aws_iam_role.clash-bot-ws-exec-role: Refreshing state... [id=clash-bot-webapp-ws-exec-role]
aws_iam_role.clash-bot-auth-task-role: Refreshing state... [id=clash-bot-webapp-auth-task-role]
aws_dynamodb_table.clash-bot-association-table: Refreshing state... [id=clash-user-team-associations]
aws_cloudwatch_log_group.clash-bot-webapp-task-logs: Refreshing state... [id=clash-bot-webapp-ecs-task-logs]
aws_cloudwatch_log_group.clash-bot-auth-task-logs: Refreshing state... [id=clash-bot-webapp-auth-ecs-task-logs]
aws_iam_policy.webapp_dynamodb_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-dynamodb-ecs-policy]
aws_lb_target_group.clash-bot-auth-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:targetgroup/clash-bot-webapp-auth-tg/4c35280edb647895]
aws_iam_role.clash-bot-auth-exec-role: Refreshing state... [id=clash-bot-webapp-auth-exec-role]
data.aws_caller_identity.current: Reading...
aws_cloudwatch_log_group.clash-bot-ws-task-logs: Refreshing state... [id=clash-bot-webapp-ws-ecs-task-logs]
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
aws_iam_policy.auth_ecr_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-auth-ecr-ecs-policy]
aws_lb.clash-bot-webapp-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:loadbalancer/app/clash-bot-webapp-lb/52dfd6c162e76ad4]
aws_security_group.clash-bot-auth-task-sg: Refreshing state... [id=sg-0d6eb942c099825f8]
aws_security_group.clash-bot-ws-task-sg: Refreshing state... [id=sg-02a58c75d03781b38]
aws_security_group.clash-bot-webapp-task-sg: Refreshing state... [id=sg-0e662860b61109e26]
aws_iam_policy.auth_logs_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-auth-ecs-logs-policy]
aws_iam_policy.webapp_logs_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-webapp-ecs-logs-policy]
aws_iam_policy.auth_ecr_registry_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-auth-ecr-ecs-registry-policy]
aws_iam_policy.auth_secrets_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-auth-secrets-ecs-policy]
aws_iam_policy.webapp_ecr_registry_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-webapp-ecr-ecs-registry-policy]
aws_iam_policy.ws_ecr_registry_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-ws-ecr-ecs-registry-policy]
aws_iam_policy.ws_logs_iam_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/clash-bot-ws-ecs-logs-policy]
aws_lb_listener.clash-bot-webapp-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57]
aws_lb_listener_rule.webapp_safe_traffic: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener-rule/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57/f3960cf72b6d4396]
aws_lb_listener_rule.auth_safe_traffic: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener-rule/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57/1199723cd4a524b1]
aws_lb_listener_rule.ws_safe_traffic: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:816923827429:listener-rule/app/clash-bot-webapp-lb/52dfd6c162e76ad4/7472c35bbe21cb57/9ddb531e31695377]
aws_iam_role_policy_attachment.ecs-ecr-repository-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-exec-role-20220815215512166300000003]
aws_iam_role_policy_attachment.ecs-logs-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-exec-role-20220815215512128100000001]
aws_iam_role_policy_attachment.ecs-ecr-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-exec-role-20220815215512138400000002]
aws_iam_role_policy_attachment.ecs-ws-logs-policy-attachment: Refreshing state... [id=clash-bot-webapp-ws-exec-role-20220815215512305000000006]
aws_iam_role_policy_attachment.ecs-ws-ecr-policy-attachment: Refreshing state... [id=clash-bot-webapp-ws-exec-role-20220815215512295800000005]
aws_iam_role_policy_attachment.ecs-ecr-ws-repository-policy-attachment: Refreshing state... [id=clash-bot-webapp-ws-exec-role-20220815215512305100000007]
aws_ecs_task_definition.clash-bot-ws-service-task-def: Refreshing state... [id=clash-bot-webapp-ws]
aws_iam_role_policy_attachment.ecs-dynamodb-policy-attachment: Refreshing state... [id=clash-bot-webapp-webapp-task-role-20220815215512205300000004]
aws_ecs_task_definition.clash-bot-webapp-task-def: Refreshing state... [id=clash-bot-webapp-service]
aws_ecs_service.clash-bot-ws-service: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-ws-service]
aws_ecs_service.clash-bot-webapp-service: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-service]
aws_iam_role_policy_attachment.ecs-auth-ecr-repository-policy-attachment: Refreshing state... [id=clash-bot-webapp-auth-exec-role-20220824031044403100000001]
aws_iam_role_policy_attachment.ecs-auth-ecr-policy-attachment: Refreshing state... [id=clash-bot-webapp-auth-exec-role-20220824031044407400000003]
aws_iam_role_policy_attachment.ecs-auth-logs-policy-attachment: Refreshing state... [id=clash-bot-webapp-auth-exec-role-20220824031044405300000002]
aws_iam_role_policy_attachment.ecs-auth-secret-policy-attachment: Refreshing state... [id=clash-bot-webapp-auth-exec-role-20220824040015783300000001]
data.aws_iam_policy_document.clash-bot-auth-secret-policy: Reading...
data.aws_iam_policy_document.clash-bot-auth-secret-policy: Read complete after 0s [id=1913472074]
aws_secretsmanager_secret.one: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:CLIENT_ID-AUTH-aLTat9]
aws_secretsmanager_secret.two: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:CLIENT_SECRET-AUTH-85nmzN]
aws_secretsmanager_secret_version.two_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:CLIENT_SECRET-AUTH-85nmzN|E2B4B5EE-AAA4-4721-AF45-BC4B27AE18C6]
aws_secretsmanager_secret_version.one_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:816923827429:secret:CLIENT_ID-AUTH-aLTat9|9F78701A-B5EA-424F-B1D8-231F599BB4CF]
aws_ecs_task_definition.clash-bot-auth-task-def: Refreshing state... [id=clash-bot-webapp-auth-service]
aws_ecs_service.clash-bot-auth-service: Refreshing state... [id=arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-auth-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.clash-bot-auth-service will be updated in-place
  ~ resource "aws_ecs_service" "clash-bot-auth-service" {
        id                                 = "arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-auth-service"
        name                               = "clash-bot-webapp-auth-service"
        tags                               = {
            "Name" = "clash-bot-webapp-ecs-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-auth-service:6" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.clash-bot-webapp-service will be updated in-place
  ~ resource "aws_ecs_service" "clash-bot-webapp-service" {
        id                                 = "arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-service"
        name                               = "clash-bot-webapp-service"
        tags                               = {
            "Name" = "clash-bot-webapp-ecs-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-service:20" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.clash-bot-ws-service will be updated in-place
  ~ resource "aws_ecs_service" "clash-bot-ws-service" {
        id                                 = "arn:aws:ecs:us-east-1:816923827429:service/clash-bot-discord-ecs/clash-bot-webapp-ws-service"
        name                               = "clash-bot-webapp-ws-service"
        tags                               = {
            "Name" = "clash-bot-webapp-ws-ecs-service"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-ws:10" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.clash-bot-auth-task-def must be replaced
-/+ resource "aws_ecs_task_definition" "clash-bot-auth-task-def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-auth-service:6" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "clash-bot-webapp-auth-service" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 6 -> (known after apply)
      ~ tags                     = {
          ~ "Release" = "" -> "PR Build"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "Release"     = "" -> "PR Build"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.clash-bot-webapp-task-def must be replaced
-/+ resource "aws_ecs_task_definition" "clash-bot-webapp-task-def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-service:20" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "clash-bot-webapp-service" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 20 -> (known after apply)
      ~ tags                     = {
          ~ "Release" = "" -> "PR Build"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "Release"     = "" -> "PR Build"
            # (3 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.clash-bot-ws-service-task-def must be replaced
-/+ resource "aws_ecs_task_definition" "clash-bot-ws-service-task-def" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816923827429:task-definition/clash-bot-webapp-ws:10" -> (known after apply)
      ~ container_definitions    = (sensitive) # forces replacement
      ~ id                       = "clash-bot-webapp-ws" -> (known after apply)
      - ipc_mode                 = "" -> null
      - pid_mode                 = "" -> null
      ~ revision                 = 10 -> (known after apply)
      ~ tags                     = {
          ~ "Release" = "" -> "PR Build"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "Release"     = "" -> "PR Build"
            # (3 unchanged elements hidden)
        }
      - task_role_arn            = "" -> null
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  ~ webapp_task_definition_version = 20 -> (known after apply)
  ~ ws_task_definition_version     = 10 -> (known after apply)

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*